# IsCombinedParameterField Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleField..::..IsCombinedParameterField Property
ScheduleField Class See Also
---
Indicates if the field is a combined parameter field.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool IsCombinedParameterField { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsCombinedParameterField As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsCombinedParameterField {
	bool get ();
}
```

# See Also
ScheduleField Class
Autodesk.Revit.DB Namespace